"<body><h5>Selected Publications</h5><ul>  <li>    N. P. Jouppi, D. Yoon, G. Kurian, S. Li, N. Patil, J. Laudon, C. Young,    and D. A. Patterson, \"A Domain-Specific Supercomputer for Training Deep    Neural Networks,\" Communications of the ACM, vol. 63, no. in press, 2020  </li>  <li>    J. L. Hennessy and D. A. Patterson, \"A new golden age for computer    architecture.,\" Commun. ACM, vol. 62, no. 2, pp. 48--60, Feb. 2019  </li>  <li>    D. A. Patterson and A. Waterman, The RISC-V Reader: An Open Architecture    Atlas, 1st ed., Strawberry Canyon, 2017  </li>  <li>    J. L. Hennessy and D. A. Patterson, Computer Architecture: A Quantitative    Approach, 6th ed., Computer Architecture and Design, Morgan Kaufmann    Publishers, 2017  </li>  <li>    D. A. Patterson and J. L. Hennessy, Computer Organization and Design    RISC-V Edition The Hardware/Software Interface, 5th ed., Amsterdam;    Boston: Elsevier/Morgan Kaufmann, 2017  </li>  <li>    A. Waterman, Y. Lee, R. Avizienis, D. A. Patterson, and K. Asanović, \"The    RISC-V Instruction Set Manual Volume II: Privileged Architecture Version    1.9.1,\" EECS Department, University of California, Berkeley, Tech. Rep.    UCB/EECS-2016-161, Nov. 2016  </li>  <li>    A. Fox, D. A. Patterson, and S. Joseph, Engineering software as a service:    an agile approach using cloud computing, Strawberry Canyon LLC, 2013  </li>  <li>    K. Asanović, R. Bodik, J. Demmel, T. Keaveny, K. Keutzer, N. Morgan, D. A.    Patterson, K. Sen, J. Wawrzynek, D. Wessel, and K. A. Yelick, \"A View of    the Parallel Computing Landscape,\" Communications of the ACM, vol. 52, no.    10, pp. 56-67, Oct. 2009  </li>  <li>    D. E. Culler, R. M. Karp, D. A. Patterson, A. Sahay, K. E. Schauser, E. E.    Santos, R. Subramonian, and T. von Eicken, \"LogP: Towards a realistic    model of parallel computation,\" in Proc. 4th ACM SIGPLAN Symp. on    Principles and Practice of Parallel Programming, New York, NY: ACM Press,    1993, pp. 1-12  </li>  <li>    D. A. Patterson, D. S. Kiser, and D. N. Smith, Computing Unbound: Using    Computers in the Arts and Sciences, W.W. Norton & Company, 1989  </li>  <li>    D. A. Patterson, G. Gibson, and R. H. Katz, \"Triple Test of Time Award: A    case for Redundant Arrays of Inexpensive Disks (RAID),\" in Proc. 1988 ACM    SIGMOD Intl. Conf. on Management of Data (SIGMOD '88), H. Boral and P.    Larson, Eds., New York, NY: The Association for Computing Machinery, Inc.,    1988, pp. 109-116  </li>  <li>    D. A. Patterson and C. H. Séquin, \"RISC I: A Reduced Instruction Set VLSI    Computer,\" in Proc. 8th Intl. Symp. on Computer Architecture, Los    Alamitos, CA: IEEE Computer Society Press, 1981, pp. 443-457  </li>  <li>    D. A. Patterson and D. R. Ditzel, \"The case for the Reduced Instruction    Set Computer,\" ACM SIGARCH Computer Architecture News, vol. 8, no. 6, pp.    25-33, Oct. 1980  </li></ul><h5>Awards, Memberships and Fellowships</h5><ul>  <li>NAI Charles Stark Draper Prize for Engineering, 2022</li>  <li>    Frontiers of Knowledge Award in Information and Communication    Technologies, 2020  </li>  <li>Textbook Excellence Award (\"Texty\"), 2019</li>  <li>ACM A.M. Turing Award, 2017</li>  <li>Berkeley Citation, 2016</li>  <li>IEEE Life Member, 2016</li>  <li>ACM SIGARCH Distinguished Service Award, 2011</li>  <li>ACM SIGOPS Hall of Fame Award, 2011</li>  <li>Eckert-Mauchly Award, 2008</li>  <li>UCLA Samueli Engineering Achievement in Academia, 2008</li>  <li>    American Association for the Advancement of Science (AAAS) Fellow, 2007  </li>  <li>ACM Distinguished Service Award, 2007</li>  <li>Computer History Museum (CHM) Fellow, 2007</li>  <li>Katayanagi Prize for Research Excellence, 2007</li>  <li>American Academy of Arts and Sciences Member, 2006</li>  <li>CRA Distinguished Service Award, 2006</li>  <li>National Academy of Sciences (NAS) Member, 2006</li>  <li>Abacus Award, 2006</li>  <li>Silicon Valley Engineering Hall of Fame, 2005</li>  <li>Computers and Communications (C&C) Prize, 2004</li>  <li>IEEE James H. Mulligan Education Medal, 2000</li>  <li>IEEE Reynold B. Johnson Information Storage Systems Award, 1999</li>  <li>    Diane S. McEntyre Award for Excellence in Teaching Computer Science, 1998  </li>  <li>IEEE Undergraduate Teaching Award, 1995</li>  <li>UCLA Computer Science Distinguished Alumni Award, 1994</li>  <li>Association for Computing Machinery (ACM) Fellow, 1994</li>  <li>National Academy of Engineering (NAE) Member, 1993</li>  <li>Institute of Electrical & Electronics Engineers (IEEE) Fellow, 1990</li>  <li>UC Berkeley Distinguished Teaching Award, 1982</li></ul></body>"